In [5]:
import numpy as np
import pandas as pd

In [6]:
students = {
    'name': ['Finley', 'Andrew', 'Blake', "Denis"],
    'last_name': ['Brown', 'Bradley', 'Hughes', "James"],
    'age': [23, 21, 34,24],
    "student_number":[101, 403, 202,1]
    

}

In [7]:
df = pd.DataFrame(students)

In [8]:
df.set_index("student_number", inplace=True)

# DataFrame - Row'lara UlaÅŸmak

## iloc

* iloc bize DataFrame'in rowlarÄ±na lokasyon bazlÄ± eriÅŸmemizi saÄŸlar. Row'larÄ±n labellarÄ±na (etiketlerine) gÃ¶re eriÅŸim **saÄŸlamaz**

In [9]:
df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

In [10]:
df.iloc[0]

name         Finley
last_name     Brown
age              23
Name: 101, dtype: object

In [11]:
df.loc[101]

name         Finley
last_name     Brown
age              23
Name: 101, dtype: object

* Mesela burada row'larÄ±n etiketleri *101,403,202,1*

* Row'larÄ±n lokasyonlarÄ± *0,1,2,3*

* iloc *0,1,2,3*' e gÃ¶re eriÅŸim yapmamÄ±zÄ± saÄŸlayacak

In [14]:
df["last_name"]

student_number
101      Brown
403    Bradley
202     Hughes
1        James
Name: last_name, dtype: object

In [ ]:
# Åžimdi row bazlÄ± indexlemeyi gÃ¶relim

In [12]:
df.iloc[0]

name         Finley
last_name     Brown
age              23
Name: 101, dtype: object

In [13]:
df.iloc[0].age

23

In [14]:
df.iloc[0]["age"]

23

* Bundan sonra DataFrame yerine **DF** yazacaÄŸÄ±m, daha kÄ±saðŸ˜Ž

* DF'lerde hem rowlar hem de columnlar Series demiÅŸtim, burada row'a ulaÅŸtÄ±ÄŸÄ±mÄ±zda da bize Series objesi dÃ¶ndÃ¼rdÃ¼

* Series'in adÄ± da row'un label'Ä± oldu

In [18]:
df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

In [19]:
df.iloc[1]

name          Andrew
last_name    Bradley
age               21
Name: 403, dtype: object

In [20]:
df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

* BurasÄ± Ã¶nemli, bize lokasyon olarak 1'deki row'u getirdi, index(etiket)'i 1 olan row'u getirmedi

In [21]:
df.iloc[0]

name         Finley
last_name     Brown
age              23
Name: 101, dtype: object

In [22]:
s1 = df.iloc[0]

In [23]:
s1

name         Finley
last_name     Brown
age              23
Name: 101, dtype: object

In [25]:
s1[0]

C:\Users\omers\AppData\Local\Temp\ipykernel_13476\643609873.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s1[0]

'Finley'

In [26]:
s1["name"]

'Finley'

In [14]:
s1.name

101

In [27]:
df.iloc[0][["name","age"]]

name    Finley
age         23
Name: 101, dtype: object

## Fancy Indexing

In [28]:
df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

In [7]:
df.iloc[[0,2]]

                  name last_name  age
student_number
101             Finley     Brown   23
202              Blake    Hughes   34

In [30]:
df.iloc[[2,0]]

                  name last_name  age
student_number
202              Blake    Hughes   34
101             Finley     Brown   23

## Belirli Bir Column'un Belirli Row'larÄ± SeÃ§mek

* Genel form indexing yaparken numpy'da olduÄŸu gibi [row, column] ÅŸeklinde olacak

In [31]:
a = np.arange(12).reshape((4,3))
a

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [32]:
a[[1,2],[0,2]]

array([3, 8])

In [33]:
df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

In [34]:
df.iloc[[0,1], "age"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

* Hata aldÄ±k Ã§Ã¼nkÃ¼ iloc hem rowlarÄ± hem de columnlarÄ± lokasyon bazlÄ± istiyor, ama bu Ã¶rnekte columnlarÄ± etiket bazlÄ±,("age"), vermiÅŸ olduk. "age" column'una denk gelen lokasyonu vermemiz lazÄ±m, 2 lokasyonu

In [35]:
df.iloc[[0,1],2] # burdaki 2 age i belirtir.

student_number
101    23
403    21
Name: age, dtype: int64

In [36]:
df.loc[[101, 403], "age"]

student_number
101    23
403    21
Name: age, dtype: int64

In [37]:
df.iloc[[0,1], [0,2]]

                  name  age
student_number
101             Finley   23
403             Andrew   21

In [38]:
df.iloc[0, [0,2]]

name    Finley
age         23
Name: 101, dtype: object

* slicing olarak index verince son deÄŸerleri dahil etmez

In [39]:
df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

In [12]:
df.iloc[0:2, 0:2]

                  name last_name
student_number
101             Finley     Brown
403             Andrew   Bradley

In [40]:
df.iloc[0:2, 0:]

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21

In [41]:
df.iloc[0:2]

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21

In [42]:
df.iloc[0:2, 0:3]

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21

## Olmayan Bir Lokasyonu iloc Ä°le Ã‡aÄŸÄ±rmak

In [43]:
df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

In [49]:
df.iloc[101]

IndexError: single positional indexer is out-of-bounds

In [46]:
l = [1,2,3,10]

In [47]:
l[20]

IndexError: list index out of range